Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиЦенныхБумагЗаблокированные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумагЗаблокированные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидБлокировкиАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБлокировокАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОтключениеКонтроляОтрицательныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтключениеКонтроляОтрицательныхОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДенежныеСредстваНаличные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДенежныеСредстваПереданныеВОплатуПаев</Name>
					<Comment>Для ведения учета в соответствии с приказом ФСФР РФ от 15.04.2008 N 08-18/пз-н "Об утверждении Положения о порядке учета имущества, переданного в оплату инвестиционных паев паевого инвестиционного фонда"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностиПоДенежнымСредствам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностиПоДенежнымСредствамПоПоручениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностиПоЦеннымБумагам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадолженностиПоЦеннымБумагамПоПоручениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаткиДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаткиЦенныхБумаг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервыПредстоящихРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстаткиЦенныхБумагЗаблокированные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвиженийДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВариационнаяМаржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаПроцентовПоЗаймуПолученному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеДепозитногоВклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗаймаВыданного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗаймаПолученного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоДепозитномуВкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоЗаймуВыданному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеДенежныхСредствНаДепозитномВкладе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСРегистрамиНакопления/Ext/Module.bsl
Процедура ЗаполнитьЗначенияСвойствДвижения(Движение, ЗначенияСвойств, СоответствияСвойств = Неопределено, РасчетныеСвойства = Неопределено) Экспорт

	ЗаполнитьЗначенияСвойств(Движение, ЗначенияСвойств);
	
	Если ТипЗнч(СоответствияСвойств) = Тип("Структура") Тогда
		Для каждого КлючЗнч Из СоответствияСвойств Цикл
			Движение[КлючЗнч.Ключ] = ЗначенияСвойств[КлючЗнч.Значение];
		КонецЦикла;
	КонецЕсли;

	Если ТипЗнч(РасчетныеСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Движение, РасчетныеСвойства);
	КонецЕсли;

КонецПроцедуры // ЗаполнитьЗначенияСвойствДвижения

Процедура СформироватьДвижения(НаборДвижений, ВидДвижения = Неопределено, Период, ПлановыеДвижения, СоответствияПолей = Неопределено) Экспорт
	
	
	Если ТипЗнч(ПлановыеДвижения) = Тип("ТаблицаЗначений")  Тогда
		
		Если ПлановыеДвижения.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого СтрокаПлановыеДвижения Из ПлановыеДвижения Цикл
			Движение = НаборДвижений.Добавить();
			
			Если ВидДвижения <> Неопределено Тогда
				Движение.ВидДвижения = ВидДвижения;
			КонецЕсли; 
			
			Движение.Период = Период;
			
			ЗаполнитьЗначенияСвойствДвижения(Движение, СтрокаПлановыеДвижения, СоответствияПолей);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ПлановыеДвижения) = Тип("ВыборкаИзРезультатаЗапроса")  Тогда
		
		Пока ПлановыеДвижения.Следующий() Цикл
			Движение = НаборДвижений.Добавить();
			
			Если ВидДвижения <> Неопределено Тогда
				Движение.ВидДвижения = ВидДвижения;
			КонецЕсли;
			
			Движение.Период = Период;
			
			ЗаполнитьЗначенияСвойствДвижения(Движение, ПлановыеДвижения, СоответствияПолей);
		КонецЦикла; 
		
		ПлановыеДвижения.Сбросить();
		
	КонецЕсли;
	
	Если НаборДвижений.Количество() <> 0 Тогда
		НаборДвижений.Записывать = Истина;
	КонецЕсли; 
	
КонецПроцедуры // СформироватьДвижения

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ДВИЖЕНИЙ ДОКУМЕНТОВ

Процедура СформироватьСводныеДвиженияПоТорговойКомиссииВСделке(Сделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Дата КАК Период,
		|	Сделка.Ссылка КАК Основание,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская) КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии) КАК ВидЗадолженности,
		|	Сделка.Организация КАК Организация,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Сделка.ВалютаТорговойКомиссии КАК Валюта,
		|	Сделка.Брокер КАК Брокер,
		|	Сделка.МестоХранения КАК МестоХранения,
		|	Сделка.Брокер.ЮрФизЛицо КАК Контрагент,
		|	Сделка.РасчетныйСчет КАК РасчетныйСчет,
		|	СуммыЗадолженности.Сумма КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата) КАК ВидДвиженияДенежныхСредств,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии) КАК ВариантДвиженияДенежныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		СделкаЦенныеБумаги.Ссылка КАК Ссылка,
		|		СУММА(СделкаЦенныеБумаги.ТорговаяКомиссия) КАК Сумма
		|	ИЗ
		|		Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|	ГДЕ
		|		СделкаЦенныеБумаги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СделкаЦенныеБумаги.Ссылка
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СделкаЦенныеБумаги.ТорговаяКомиссия) > 0) КАК СуммыЗадолженности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО (Сделка.Ссылка = СуммыЗадолженности.Ссылка)";

	Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);
	
	ИмяДокумента = Сделка.Метаданные().Имя;
	
	Если ИмяДокумента = "СделкаРЕПО" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка", "СделкаРЕПО");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Сделка.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход(), Выборка);
		
		Если Не Сделка.ОтложеннаяОплатаТорговойКомиссии Тогда
			ЗаполнитьЗначенияСвойств(Сделка.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход(), Выборка);
			ЗаполнитьЗначенияСвойств(Сделка.Движения.ОстаткиДенежныхСредств.ДобавитьРасход(), Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СформироватьСводныеДвиженияПоТорговойКомиссииВСделке

////////////////////////////////////////////////////////////////////////////////
// НОВАЯ СХЕМА ПРОВЕДЕНИЯ

Функция ПолучитьИменаБухгалтерскихРегистров() Экспорт

	МассивИменБухгалтерскихРегистров = Новый Массив;
	
	МассивИменБухгалтерскихРегистров.Добавить("БухПартииСрочныхКонтрактов");
	МассивИменБухгалтерскихРегистров.Добавить("БухПартииЦенныхБумагКПолучению");
	МассивИменБухгалтерскихРегистров.Добавить("БухПартииЦенныхБумагКупленныеПоРЕПО");
	МассивИменБухгалтерскихРегистров.Добавить("БухПартииЦенныхБумагПроданныеВРепо");
	МассивИменБухгалтерскихРегистров.Добавить("БухПартииЦенныхБумаг");
	
	МассивИменБухгалтерскихРегистров.Добавить("БухгалтерскийУчет");
	МассивИменБухгалтерскихРегистров.Добавить("ЕдиныйБухгалтерскийУчет");
	МассивИменБухгалтерскихРегистров.Добавить("НалоговыйУчет");
	
	Возврат МассивИменБухгалтерскихРегистров;

КонецФункции 

Процедура ОчиститьДвиженияПоБэкофису(Регистратор) Экспорт
	
	// т.к. данная процедура вызывается из обработки проведения, когда объект уже
	// записан и флаг "Проведен" установлен, то проверять очищаем движения документа всегда
	
	МассивИменБухгалтерскихРегистров = ПолучитьИменаБухгалтерскихРегистров();
	
	Для каждого НаборЗаписей Из Регистратор.Движения Цикл
		Если МассивИменБухгалтерскихРегистров.Найти(НаборЗаписей.Метаданные().Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей.Очистить();
	КонецЦикла;
	
КонецПроцедуры // ОчиститьДвижения

Функция ПроверитьНаличиеОстатков(Регистратор, ИмяРегистра) Экспорт
	
	Измерения = РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра("РегистрыНакопления", ИмяРегистра,, Истина, Истина);
	Ресурсы   = РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра("РегистрыНакопления", ИмяРегистра, Истина,, Истина);
	
	// выделим условия отбора вирт. таблицы остатков
	ПараметрыВиртТаблицыОстатков = ПолучитьНаборУникальныхЗначений(Регистратор.Движения[ИмяРегистра], Измерения);
	
	Если ПараметрыВиртТаблицыОстатков.Количество() = 0 Тогда // т.к. регистра без измерений быть не может, значим набор данных был пустой
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	Запрос.УстановитьПараметр("Период",      Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Включая));
	
	// сформируем "модификанты" текста запроса и добавим параметры в запрос 
	ИзмеренияОстаткиВЗапросе                   = "";
	РесурсыОстаткиВЗапросе                     = "";
	ПараметрыВиртТаблицыОстатковВЗапросе       = "";
	УсловиеОтбораОтрицательныхОстатковВЗапросе = "";
	
	МаксИнд = Измерения.ВГраница();
	
	Для Инд = 0 По МаксИнд Цикл
		Измерение = Измерения[Инд];
		ЗнчОтбора = ПараметрыВиртТаблицыОстатков[Измерение];
		
		Если ТипЗнч(ЗнчОтбора) = Тип("Массив") И ЗнчОтбора.Количество() = 1 Тогда
			ЗнчОтбора = ЗнчОтбора[0];
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Измерение, ЗнчОтбора);
		
		ИзмеренияОстаткиВЗапросе             = ИзмеренияОстаткиВЗапросе + Символы.Таб + ИмяРегистра + "Остатки." + Измерение + ?(Инд < МаксИнд, "," + Символы.ПС, "");
		ПараметрыВиртТаблицыОстатковВЗапросе = ПараметрыВиртТаблицыОстатковВЗапросе + ?(Инд = 0, "", " И ") + Измерение + ?(ТипЗнч(ЗнчОтбора) = Тип("Массив"), " В(&", " = &") + Измерение + ?(ТипЗнч(ЗнчОтбора) = Тип("Массив"), ")", "");
	КонецЦикла;
	
	МаксИнд = Ресурсы.ВГраница();
	
	Для Инд = 0 По МаксИнд Цикл
		Ресурс = Ресурсы[Инд];
		
		РесурсыОстаткиВЗапросе                     = РесурсыОстаткиВЗапросе + Символы.Таб + ИмяРегистра + "Остатки." + Ресурс + "Остаток" + ?(Инд < МаксИнд, "," + Символы.ПС, "");
		УсловиеОтбораОтрицательныхОстатковВЗапросе = УсловиеОтбораОтрицательныхОстатковВЗапросе + ?(Инд = 0, "", Символы.ПС + Символы.Таб + Символы.Таб + "ИЛИ ") + ИмяРегистра + "Остатки." + Ресурс + "Остаток <> 0";
	КонецЦикла;
	
	// получим остатки, если таковые имеют место быть
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНООстатки.Организация,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(&Период, Организация = &Организация) КАК ДенежныеСредстваМНООстатки
		|ГДЕ
		|	ДенежныеСредстваМНООстатки.СуммаОстаток <> 0";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДенежныеСредстваМНООстатки.СуммаОстаток <> 0", УсловиеОтбораОтрицательныхОстатковВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ДенежныеСредстваМНООстатки.Организация",    ИзмеренияОстаткиВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ДенежныеСредстваМНООстатки.СуммаОстаток",   РесурсыОстаткиВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, " Организация = &Организация",                 ПараметрыВиртТаблицыОстатковВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДенежныеСредстваМНО",                         ИмяРегистра);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ПроверитьНаличиеОстатков
	
Процедура ПроверитьОтрицательныеОстаткиЗадолженностиПоЦеннымБумагамПоПоручениям(Регистратор, Отказ) Экспорт
	
	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ЗадолженностиПоЦеннымБумагамПоПоручениям", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		СтрокаКлюч = "Организация = " + СтрокаОтрицательныеОстатки.Организация
					+ ", Счет доверительного управления = " + СтрокаОтрицательныеОстатки.СчетДоверительногоУправления
					+ ", Поручение = " + СтрокаОтрицательныеОстатки.Поручение
					+ ", Тип задолженности = " + СтрокаОтрицательныеОстатки.ТипЗадолженности
					+ ", Ценная бумага = " + СтрокаОтрицательныеОстатки.ЦеннаяБумага;
					
		Если СтрокаОтрицательныеОстатки.КоличествоОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по количеству ц/б (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Количество"), Регистратор,,, Отказ);
		КонецЕсли;
		Если СтрокаОтрицательныеОстатки.СуммаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по сумме ц/б (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
		Если СтрокаОтрицательныеОстатки.СуммаКупонаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по сумме купона ц/б (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "СуммаКупона") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьОтрицательныеОстаткиЗадолженностиПоЦеннымБумагамПоПоручениям

Процедура ПроверитьОтрицательныеОстаткиЗадолженностиПоЦеннымБумагам(Регистратор, Отказ) Экспорт
	
	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ЗадолженностиПоЦеннымБумагам", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		СтрокаКлюч = "Организация = " + СтрокаОтрицательныеОстатки.Организация
					+ ", Счет доверительного управления = " + СтрокаОтрицательныеОстатки.СчетДоверительногоУправления
					+ ", Основание = " + СтрокаОтрицательныеОстатки.Основание
					+ ", Тип задолженности = " + СтрокаОтрицательныеОстатки.ТипЗадолженности
					+ ", Вид задолженности = " + СтрокаОтрицательныеОстатки.ВидЗадолженности
					+ ", Ценная бумага = " + СтрокаОтрицательныеОстатки.ЦеннаяБумага;
					
		Если СтрокаОтрицательныеОстатки.КоличествоОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по количеству ц/б (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Количество"), Регистратор,,, Отказ);
		КонецЕсли;
		Если СтрокаОтрицательныеОстатки.СуммаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по сумме ц/б (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
		Если СтрокаОтрицательныеОстатки.СуммаКупонаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по сумме купона ц/б (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "СуммаКупона") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьОтрицательныеОстаткиЗадолженностиПоЦеннымБумагам

Процедура ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствамПоПоручениям(Регистратор, Отказ) Экспорт

	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ЗадолженностиПоДенежнымСредствамПоПоручениям", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		СтрокаКлюч = "Организация = " + СтрокаОтрицательныеОстатки.Организация
					+ ", Счет доверительного управления = " + СтрокаОтрицательныеОстатки.СчетДоверительногоУправления
					+ ", Основание = " + СтрокаОтрицательныеОстатки.Основание
					+ ", Тип задолженности = " + СтрокаОтрицательныеОстатки.ТипЗадолженности;
					
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры // ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствамПоПоручениям

Процедура ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам(Регистратор, Отказ) Экспорт

	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ЗадолженностиПоДенежнымСредствам", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		СтрокаКлюч = "Организация = " + СтрокаОтрицательныеОстатки.Организация
					+ ", Счет доверительного управления = " + СтрокаОтрицательныеОстатки.СчетДоверительногоУправления
					+ ", Основание = " + СтрокаОтрицательныеОстатки.Основание
					+ ", Тип задолженности = " + СтрокаОтрицательныеОстатки.ТипЗадолженности
					+ ", Вид задолженности = " + СтрокаОтрицательныеОстатки.ВидЗадолженности;
					
		Если ЗначениеЗаполнено(СтрокаОтрицательныеОстатки.Контрагент) Тогда
			СтрокаКлюч = СтрокаКлюч + ", Контрагент = " + СтрокаОтрицательныеОстатки.Контрагент;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаОтрицательныеОстатки.Контрагент) Тогда
			СтрокаКлюч = СтрокаКлюч + ", Аванс = " + СтрокаОтрицательныеОстатки.Аванс;
		КонецЕсли;
		
		Если СтрокаОтрицательныеОстатки.СуммаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по сумме (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
		Если СтрокаОтрицательныеОстатки.СуммаКупонаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышена задолженность по сумме купона (" + СтрокаКлюч + ") " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "СуммаКупона") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам

Процедура ПроверитьОтрицательныеОстаткиДенежныхСредств(Регистратор, Отказ) Экспорт
	
	ПроверитьНаличиеДвиженийПоРегистру(Регистратор, "ОстаткиДенежныхСредств", Отказ);
	
	Если Отказ Или ОтключенКонтрольОтрицательныхОстатковПоРегистру(Регистратор, "ОстаткиДенежныхСредств") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоступныеОстаткиДенежныхСредств.Организация КАК Организация,
		|	ДоступныеОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДоступныеОстаткиДенежныхСредств.Брокер КАК Брокер,
		|	ДоступныеОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
		|	ДоступныеОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
		|	ДоступныеОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	СУММА(ДоступныеОстаткиДенежныхСредств.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ДоступныеОстаткиДенежныхСредств.МНО) КАК МНО
		|ПОМЕСТИТЬ _ОтрицательныеОстатки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиДенежныхСредствОстатки.Организация КАК Организация,
		|		ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредствОстатки.Брокер КАК Брокер,
		|		ОстаткиДенежныхСредствОстатки.МестоХранения КАК МестоХранения,
		|		ОстаткиДенежныхСредствОстатки.РасчетныйСчет КАК РасчетныйСчет,
		|		ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|		ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток,
		|		0 КАК МНО
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Брокер = &Брокер
		|					И МестоХранения = &МестоХранения
		|					И РасчетныйСчет = &РасчетныйСчет
		|					И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДенежныеСредстваМНООстатки.Организация,
		|		ДенежныеСредстваМНООстатки.СчетДоверительногоУправления,
		|		ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|		ДенежныеСредстваМНООстатки.РасчетныйСчет,
		|		ДенежныеСредстваМНООстатки.РасчетныйСчет.Валюта,
		|		0,
		|		ДенежныеСредстваМНООстатки.СуммаОстаток
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И РасчетныйСчет = &РасчетныйСчет) КАК ДенежныеСредстваМНООстатки) КАК ДоступныеОстаткиДенежныхСредств
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеОстаткиДенежныхСредств.Организация,
		|	ДоступныеОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|	ДоступныеОстаткиДенежныхСредств.Брокер,
		|	ДоступныеОстаткиДенежныхСредств.МестоХранения,
		|	ДоступныеОстаткиДенежныхСредств.РасчетныйСчет,
		|	ДоступныеОстаткиДенежныхСредств.Валюта
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДоступныеОстаткиДенежныхСредств.СуммаОстаток) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОтрицательныеОстатки.Организация КАК Организация,
		|	_ОтрицательныеОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОтрицательныеОстатки.Брокер КАК Брокер,
		|	_ОтрицательныеОстатки.МестоХранения КАК МестоХранения,
		|	_ОтрицательныеОстатки.РасчетныйСчет КАК РасчетныйСчет,
		|	_ОтрицательныеОстатки.Валюта КАК Валюта,
		|	_ОтрицательныеОстатки.СуммаОстаток КАК СуммаОстаток,
		|	_ОтрицательныеОстатки.МНО КАК МНО,
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма
		|ИЗ
		|	_ОтрицательныеОстатки КАК _ОтрицательныеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОстаткиДенежныхСредств.Организация КАК Организация,
		|			ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			ОстаткиДенежныхСредств.Брокер КАК Брокер,
		|			ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
		|			ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
		|			ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|			СУММА(ОстаткиДенежныхСредств.Сумма) КАК Сумма
		|		ИЗ
		|			РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ГДЕ
		|			ОстаткиДенежныхСредств.Регистратор = &Регистратор
		|			И ОстаткиДенежныхСредств.Активность
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОстаткиДенежныхСредств.Организация,
		|			ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|			ОстаткиДенежныхСредств.Брокер,
		|			ОстаткиДенежныхСредств.МестоХранения,
		|			ОстаткиДенежныхСредств.РасчетныйСчет,
		|			ОстаткиДенежныхСредств.Валюта) КАК ОстаткиДенежныхСредств
		|		ПО _ОтрицательныеОстатки.Организация = ОстаткиДенежныхСредств.Организация
		|			И _ОтрицательныеОстатки.СчетДоверительногоУправления = ОстаткиДенежныхСредств.СчетДоверительногоУправления
		|			И _ОтрицательныеОстатки.Брокер = ОстаткиДенежныхСредств.Брокер
		|			И _ОтрицательныеОстатки.МестоХранения = ОстаткиДенежныхСредств.МестоХранения
		|			И _ОтрицательныеОстатки.РасчетныйСчет = ОстаткиДенежныхСредств.РасчетныйСчет
		|			И _ОтрицательныеОстатки.Валюта = ОстаткиДенежныхСредств.Валюта";

	Запрос.УстановитьПараметр("Период",      Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	
	ПараметрыВиртТаблицы = ПолучитьНаборУникальныхЗначений(Регистратор.Движения.ОстаткиДенежныхСредств,
		РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Организация, СчетДоверительногоУправления, Брокер, МестоХранения, РасчетныйСчет, Валюта", ",", Истина, Истина));
		
	Для каждого ПараметрВиртТаблицы Из ПараметрыВиртТаблицы Цикл
		Запрос.УстановитьПараметр(ПараметрВиртТаблицы.Ключ, ПараметрВиртТаблицы.Значение);
		
		Если ТипЗнч(ПараметрВиртТаблицы.Значение) = Тип("Массив") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ПараметрВиртТаблицы.Ключ + " = &" + ПараметрВиртТаблицы.Ключ, ПараметрВиртТаблицы.Ключ + " В(" + ПараметрВиртТаблицы.Ключ + ")");
		КонецЕсли;
	КонецЦикла;	
		
	// По договору МНО достаточно, чтобы на конец текущего (начало следующего) дня остаток д/с
	// на р/счет был не менее установленной суммы. Тем не менее, случаи, когда при проведении
	// документа остаток на счете уходит ниже МНО, и это нельзя исправить изменение последовательности
	// документов, крайне редки. Если при проведении выводить предупреждение о нарушении условий МНО,
	// то в запарке его могут не заметить, МНО нарушится и фирма потеряет прибыль. В результате, девочки
	// из бэк-офиса при проведении в текущей и будущей дате попросили запрещать проведение расходных
	// движений в подобной ситуации.
	ПроведениеЗаднимЧислом = НачалоДня(Регистратор.Дата) < НачалоДня(ТекущаяДатаСеанса());

	Если Не ПроведениеЗаднимЧислом Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"СУММА(ДоступныеОстаткиДенежныхСредств.СуммаОстаток) < 0",
			"СУММА(ДоступныеОстаткиДенежныхСредств.СуммаОстаток) -  СУММА(ДоступныеОстаткиДенежныхСредств.МНО) < 0");
	КонецЕсли;
		
	ОтрицательныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Если ОтрицательныеОстатки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно д/с на " + ?(ЗначениеЗаполнено(СтрокаОтрицательныеОстатки.РасчетныйСчет), "р/счете " + СтрокаОтрицательныеОстатки.РасчетныйСчет, "бирже " + СтрокаОтрицательныеОстатки.МестоХранения)
			+ ?(ЗначениеЗаполнено(СтрокаОтрицательныеОстатки.Брокер), " по брокеру " + СтрокаОтрицательныеОстатки.Брокер, " (без брокера)")
			+ ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма")
			+ ?(ПроведениеЗаднимЧислом, "", ". В т.ч. в МНО: " + СтрокаОтрицательныеОстатки.МНО), Регистратор,,, Отказ);
	КонецЦикла;
		
КонецПроцедуры // ПроверитьОтрицательныеОстаткиДенежныхСредств

Процедура ПроверитьОтрицательныеОстаткиЦенныхБумаг(Регистратор, Отказ) Экспорт
	
	ПроверитьНаличиеДвиженийПоРегистру(Регистратор, "ОстаткиЦенныхБумаг", Отказ);
	
	Если Отказ Или ОтключенКонтрольОтрицательныхОстатковПоРегистру(Регистратор, "ОстаткиЦенныхБумаг") Тогда
		Возврат;
	КонецЕсли;
	
	Если //нет реквизита "Рынок", поэтому исключим в условии
		ТипЗнч(Регистратор) <> Тип("ДокументОбъект.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО") 
		 И ((Регистратор.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы) Или (Регистратор.Рынок = Перечисления.РынкиЦенныхБумаг.Опционы)) Тогда
		 
			Возврат;
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СводныеОстатки.Организация КАК Организация,
		|	СводныеОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СводныеОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	СводныеОстатки.Рынок КАК Рынок,
		|	СводныеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(СводныеОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(СводныеОстатки.ЗаблокированоОстаток) КАК ЗаблокированоОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиЦенныхБумагОстатки.Организация КАК Организация,
		|		ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|		ОстаткиЦенныхБумагОстатки.Рынок КАК Рынок,
		|		ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|		0 КАК ЗаблокированоОстаток
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ДепозитарныйСчет = &ДепозитарныйСчет
		|					И Рынок = &Рынок
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиЦенныхБумагЗаблокированныеОстатки.Организация,
		|		ОстаткиЦенныхБумагЗаблокированныеОстатки.СчетДоверительногоУправления,
		|		ОстаткиЦенныхБумагЗаблокированныеОстатки.ДепозитарныйСчет,
		|		ОстаткиЦенныхБумагЗаблокированныеОстатки.Рынок,
		|		ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага,
		|		0,
		|		ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ДепозитарныйСчет = &ДепозитарныйСчет
		|					И Рынок = &Рынок
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагЗаблокированныеОстатки) КАК СводныеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	СводныеОстатки.Организация,
		|	СводныеОстатки.СчетДоверительногоУправления,
		|	СводныеОстатки.ДепозитарныйСчет,
		|	СводныеОстатки.Рынок,
		|	СводныеОстатки.ЦеннаяБумага
		|
		|ИМЕЮЩИЕ
		|	СУММА(СводныеОстатки.КоличествоОстаток) - СУММА(СводныеОстатки.ЗаблокированоОстаток) < 0";

	Запрос.УстановитьПараметр("Период", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Включая));
	
	ПараметрыВиртТаблицы = ПолучитьНаборУникальныхЗначений(Регистратор.Движения.ОстаткиЦенныхБумаг,
		РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Организация, СчетДоверительногоУправления, ДепозитарныйСчет, Рынок, ЦеннаяБумага", ",", Истина, Истина));
		
	Для каждого ПараметрВиртТаблицы Из ПараметрыВиртТаблицы Цикл
		Запрос.УстановитьПараметр(ПараметрВиртТаблицы.Ключ, ПараметрВиртТаблицы.Значение);
		
		Если ТипЗнч(ПараметрВиртТаблицы.Значение) = Тип("Массив") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ПараметрВиртТаблицы.Ключ + " = &" + ПараметрВиртТаблицы.Ключ, ПараметрВиртТаблицы.Ключ + " В(&" + ПараметрВиртТаблицы.Ключ + ")");
		КонецЕсли;
	КонецЦикла;

	ОтрицательныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Если ОтрицательныеОстатки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтрицательныеОстатки = ДополнитьТаблицуОтрицательныхОстатковТребуемымиРесурсами(ОтрицательныеОстатки, Регистратор, "ОстаткиЦенныхБумаг");
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно ц/б " + СтрокаОтрицательныеОстатки.ЦеннаяБумага + " на счете депо " + СтрокаОтрицательныеОстатки.ДепозитарныйСчет
			+ ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Количество")
			+ ". В т.ч. заблокировано: " + СтрокаОтрицательныеОстатки.ЗаблокированоОстаток, Регистратор,,, Отказ);
	КонецЦикла;

КонецПроцедуры // ПроверитьОтрицательныеОстаткиПоЦеннымБумагам

Процедура ПроверитьОтрицательныеОстаткиЦенныхБумагЗаблокированных(Регистратор, Отказ) Экспорт
	
	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ОстаткиЦенныхБумагЗаблокированные", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточное количество " + СтрокаОтрицательныеОстатки.ЦеннаяБумага + " на счете депо " + СтрокаОтрицательныеОстатки.ДепозитарныйСчет + " в регистре 'Остатки ценных бумаг заблокированные'." + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Количество"), Регистратор,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверитьОтрицательныеОстаткиНаличныхДенежныхСредств(Регистратор, Отказ) Экспорт

	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ДенежныеСредстваНаличные", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно д/с в кассе " + СтрокаОтрицательныеОстатки.Касса + "." + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма"), Регистратор,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры // ПроверитьОтрицательныеОстаткиНаличныхДенежныхСредств

Процедура ПроверитьОтрицательныеОстаткиДенежныхСредствПереданныхВОплатуПаев(Регистратор, Отказ) Экспорт
	
	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "ДенежныеСредстваПереданныеВОплатуПаев", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		Если СтрокаОтрицательныеОстатки.СуммаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно д/с переданных в оплату паев пайщиком " + СтрокаОтрицательныеОстатки.Пайщик + " на р/счете " + СтрокаОтрицательныеОстатки.РасчетныйСчет + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма") + " " + СтрокаОтрицательныеОстатки.РасчетныйСчет.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПроверитьОтрицательныеОстаткиДенежныхСредствПереданныхВОплатуПаев

Процедура ПроверитьОтрицательныеОстаткиРезервовПредстоящихРасходов(Регистратор, Отказ) Экспорт

	ОтрицательныеОстатки = НайтиОтрицательныеОстатки(Регистратор, "РезервыПИФ", Отказ);
	
	Для каждого СтрокаОтрицательныеОстатки Из ОтрицательныеОстатки Цикл
		Если СтрокаОтрицательныеОстатки.СуммаОстаток < 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Превышен резерв предстоящих расходов по сумме " + ОтобразитьОтрицательныйОстаток(СтрокаОтрицательныеОстатки, "Сумма") + " " + СтрокаОтрицательныеОстатки.Валюта, Регистратор,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам

////////////////////////////////////////////////////////////////////////////////

Функция ОтобразитьОтрицательныйОстаток(Ресурсы, ИмяРесурса, ИмяРесурсаОстатка = "Остаток")
	
	Требуется = Ресурсы[ИмяРесурса];
	Остаток   = Ресурсы[ИмяРесурса + ИмяРесурсаОстатка] + Требуется;
	
	Возврат ". Требуется: " + Требуется + ". Доступно: " + Остаток;
	
КонецФункции // ОтобразитьОтрицательныйОстаток

Функция ДополнитьТаблицуОтрицательныхОстатковТребуемымиРесурсами(ОтрицательныеОстатки, Регистратор, ИмяРегистра, Измерения = Неопределено, Ресурсы = Неопределено)
	
	Если ОтрицательныеОстатки.Количество() = 0 Тогда
		Возврат ОтрицательныеОстатки;
	КонецЕсли;
	
	Если Измерения = Неопределено Тогда
		Измерения = РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра("РегистрыНакопления", ИмяРегистра,, Истина, Истина);
	КонецЕсли;
	
	Если Ресурсы = Неопределено Тогда
		Ресурсы = РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра("РегистрыНакопления", ИмяРегистра, Истина,, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОтрицательныеОстатки", ОтрицательныеОстатки);
	Запрос.УстановитьПараметр("Регистратор",          Регистратор.Ссылка);
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Звездочка КАК Звездочка
		|ПОМЕСТИТЬ _ОтрицательныеОстатки
		|ИЗ
		|	&ОтрицательныеОстатки КАК ОтрицательныеОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДвиженияИзмерения КАК ДвиженияИзмерения,
		|	СУММА(Движения.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _Движения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО КАК Движения
		|ГДЕ
		|	Движения.Регистратор = &Регистратор
		|	И Движения.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	Движения.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ОтрицательныеОстаткиЗвездочка КАК ОтрицательныеОстаткиЗвездочка,
		|	_Движения.Сумма КАК Сумма
		|ИЗ
		|	_ОтрицательныеОстатки КАК _ОтрицательныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Движения КАК _Движения
		|		ПО (&УсловияСоединенияТаблицВЗапросе)";
		
	// модифицируем текст запроса
	ДвиженияИзмеренияВЗапросе       = Новый Массив;
	ДвиженияРесурсыВЗапросе         = Новый Массив;
	ДвиженияПоляГруппировкиВЗапросе = Новый Массив;
	СуммыДвиженийРесурсовВЗапросе   = Новый Массив;
	УсловияСоединенияТаблицВЗапросе = Новый Массив;
	
	Для каждого Измерение Из Измерения Цикл
		
		Если ОтрицательныеОстатки.Колонки.Найти(Измерение) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДвиженияИзмеренияВЗапросе.Добавить("Движения." + Измерение + " КАК " + Измерение);
		ДвиженияПоляГруппировкиВЗапросе.Добавить("Движения." + Измерение);
		УсловияСоединенияТаблицВЗапросе.Добавить("_ОтрицательныеОстатки." + Измерение + " = _Движения." + Измерение);
		
	КонецЦикла;
		
	Для каждого Ресурс Из Ресурсы Цикл
		ДвиженияРесурсыВЗапросе.Добавить("_Движения." + Ресурс + " КАК " + Ресурс);
		СуммыДвиженийРесурсовВЗапросе.Добавить("СУММА(Движения." + Ресурс + ") КАК " + Ресурс);
	КонецЦикла;
	
	ЗапятаяПСТаб = "," + Символы.ПС + Символы.Таб;

	// сначала меняем текст запроса, потом параметры -- только в таком порядке
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"СУММА(Движения.Сумма) КАК Сумма", СтрСоединить(СуммыДвиженийРесурсовВЗапросе, ЗапятаяПСТаб));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"Движения.Организация", СтрСоединить(ДвиженияПоляГруппировкиВЗапросе, ЗапятаяПСТаб));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"_Движения.Сумма КАК Сумма", СтрСоединить(ДвиженияРесурсыВЗапросе, ЗапятаяПСТаб));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&Звездочка КАК Звездочка", "*");
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ОтрицательныеОстаткиЗвездочка КАК ОтрицательныеОстаткиЗвездочка", "_ОтрицательныеОстатки.*");
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"(&УсловияСоединенияТаблицВЗапросе)", СтрСоединить(УсловияСоединенияТаблицВЗапросе, Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб + "И "));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ДвиженияИзмерения КАК ДвиженияИзмерения", СтрСоединить(ДвиженияИзмеренияВЗапросе, ЗапятаяПСТаб));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ДенежныеСредстваМНО", ИмяРегистра);
	
	// результат
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ДополнитьТаблицуОтрицательныхОстатковТребуемымиРесурсами

Функция НайтиОтрицательныеОстатки(Регистратор, ИмяРегистра, Отказ)

	ПроверитьНаличиеДвиженийПоРегистру(Регистратор, ИмяРегистра, Отказ);
	
	Если Отказ Или ОтключенКонтрольОтрицательныхОстатковПоРегистру(Регистратор, ИмяРегистра) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Измерения = РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра("РегистрыНакопления", ИмяРегистра,, Истина, Истина);
	Ресурсы   = РаботаСМетаданнымиПовтИсп.ПолучитьИменаПолейРегистра("РегистрыНакопления", ИмяРегистра, Истина,, Истина);
	
	// выделим условия отбора вирт. таблицы остатков
	ПараметрыВиртТаблицыОстатков = ПолучитьНаборУникальныхЗначений(Регистратор.Движения[ИмяРегистра], Измерения);
	
	Если ПараметрыВиртТаблицыОстатков.Количество() = 0 Тогда // т.к. регистра без измерений быть не может, значим набор данных был пустой
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	Запрос.УстановитьПараметр("Период",      Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Включая));
	
	// сформируем "модификанты" текста запроса и добавим параметры в запрос 
	ИзмеренияОстаткиВЗапросе                   = "";
	РесурсыОстаткиВЗапросе                     = "";
	ПараметрыВиртТаблицыОстатковВЗапросе       = "";
	УсловиеОтбораОтрицательныхОстатковВЗапросе = "";
	
	МаксИнд = Измерения.ВГраница();
	
	Для Инд = 0 По МаксИнд Цикл
		Измерение = Измерения[Инд];
		ЗнчОтбора = ПараметрыВиртТаблицыОстатков[Измерение];
		
		Если ТипЗнч(ЗнчОтбора) = Тип("Массив") И ЗнчОтбора.Количество() = 1 Тогда
			ЗнчОтбора = ЗнчОтбора[0];
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Измерение, ЗнчОтбора);
		
		ИзмеренияОстаткиВЗапросе             = ИзмеренияОстаткиВЗапросе + Символы.Таб + ИмяРегистра + "Остатки." + Измерение + ?(Инд < МаксИнд, "," + Символы.ПС, "");
		ПараметрыВиртТаблицыОстатковВЗапросе = ПараметрыВиртТаблицыОстатковВЗапросе + ?(Инд = 0, "", " И ") + Измерение + ?(ТипЗнч(ЗнчОтбора) = Тип("Массив"), " В(&", " = &") + Измерение + ?(ТипЗнч(ЗнчОтбора) = Тип("Массив"), ")", "");
	КонецЦикла;
	
	// Для регистра резервов не нужно контролировать остатки по резервам ПИФ (контролируются отдельно при проведении регламентных операций)
	Если ИмяРегистра = "РезервыПИФ" Тогда
		ПараметрыВиртТаблицыОстатковВЗапросе = ПараметрыВиртТаблицыОстатковВЗапросе + " И НЕ (СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) И Резерв В (ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеДепозитарияАудитораОценщика), ЗНАЧЕНИЕ(Справочник.Резервы.ПрочиеВозмещаемыеРасходыУправляющего)))";
	КонецЕсли;
	
	МаксИнд = Ресурсы.ВГраница();
	
	Для Инд = 0 По МаксИнд Цикл
		Ресурс = Ресурсы[Инд];
		
		РесурсыОстаткиВЗапросе                     = РесурсыОстаткиВЗапросе + Символы.Таб + ИмяРегистра + "Остатки." + Ресурс + "Остаток" + ?(Инд < МаксИнд, "," + Символы.ПС, "");
		УсловиеОтбораОтрицательныхОстатковВЗапросе = УсловиеОтбораОтрицательныхОстатковВЗапросе + ?(Инд = 0, "", Символы.ПС + Символы.Таб + Символы.Таб + "ИЛИ ") + ИмяРегистра + "Остатки." + Ресурс + "Остаток < 0";
	КонецЦикла;
	
	// получим отрицательные остатки, если таковые имеют место быть
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНООстатки.Организация,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(&Период, Организация = &Организация) КАК ДенежныеСредстваМНООстатки
		|ГДЕ
		|	ДенежныеСредстваМНООстатки.СуммаОстаток < 0";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДенежныеСредстваМНООстатки.СуммаОстаток < 0", УсловиеОтбораОтрицательныхОстатковВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ДенежныеСредстваМНООстатки.Организация",    ИзмеренияОстаткиВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ДенежныеСредстваМНООстатки.СуммаОстаток",   РесурсыОстаткиВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, " Организация = &Организация",                 ПараметрыВиртТаблицыОстатковВЗапросе);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДенежныеСредстваМНО",                         ИмяРегистра);
	
	ОтрицательныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Если ОтрицательныеОстатки.Количество() = 0 Тогда
		Возврат ОтрицательныеОстатки;
	Иначе
		// т.к. сутация довольно редкая и завязана на интерактив, поэтому требуемые ресурсы
		// получим от выборки отрицательных остатков, чтобы она занимала минимум времени
		Возврат ДополнитьТаблицуОтрицательныхОстатковТребуемымиРесурсами(ОтрицательныеОстатки, Регистратор, ИмяРегистра, Измерения, Ресурсы);
	КонецЕсли;	
	
КонецФункции // НайтиОтрицательныеОстатки

Функция ПолучитьНаборУникальныхЗначений(НаборЗначений, Поля)
	
	НаборУникальныхЗначений = Новый Структура();
	
	Для Инд = 0 По НаборЗначений.Количество() - 1 Цикл
		Запись = НаборЗначений[Инд];
		
		Для каждого Поле Из Поля Цикл
			ЗнчИзмерения = Запись[Поле];
			
			Если Инд = 0 Тогда
				НаборУникальныхЗначений.Вставить(Поле, ЗнчИзмерения);
			Иначе
				Если ТипЗнч(НаборУникальныхЗначений[Поле]) = Тип("Массив") Тогда
					Если НаборУникальныхЗначений[Поле].Найти(ЗнчИзмерения) = Неопределено Тогда
						НаборУникальныхЗначений[Поле].Добавить(ЗнчИзмерения);
					КонецЕсли;
				Иначе
					Если НаборУникальныхЗначений[Поле] <> ЗнчИзмерения Тогда
						МассивЗнчИзмерений = Новый Массив();
						МассивЗнчИзмерений.Добавить(НаборУникальныхЗначений[Поле]);
						МассивЗнчИзмерений.Добавить(ЗнчИзмерения);
						
						НаборУникальныхЗначений[Поле] = МассивЗнчИзмерений;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НаборУникальныхЗначений;
	
КонецФункции // ПолучитьНаборУникальныхЗначений

Процедура ПроверитьНаличиеДвиженийПоРегистру(Регистратор, ИмяРегистра, Отказ)
	
	Если Регистратор.Движения[ИмяРегистра].Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Регистратор + " не сформировал движений по регистру '" + Метаданные.РегистрыНакопления[ИмяРегистра].Представление() + "'",,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьНаличиеДвиженийПоРегистру

Функция ОтключенКонтрольОтрицательныхОстатковПоРегистру(Регистратор, ИмяРегистра)
	
	КонтрольОтключен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ИмяРегистра
		|ИЗ
		|	РегистрСведений.ОтключениеКонтроляОтрицательныхОстатков КАК ОтключениеКонтроляОтрицательныхОстатков
		|ГДЕ
		|	ОтключениеКонтроляОтрицательныхОстатков.Документ = &Документ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяРегистра", ИмяРегистра);
	
	Запрос.УстановитьПараметр("Документ", Регистратор.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КонтрольОтключен = Выборка[ИмяРегистра];
	КонецЕсли;
	
	Возврат КонтрольОтключен;
	
КонецФункции // ОтключенКонтрольОтрицательныхОстатковПоРегистру
